## staging: eks
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 2 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                NAME                                |
|----------|--------------------------------------------------------------------|
| update   | `aws_eks_node_group.notification-canada-ca-eks-node-group-k8s`     |
|          | `module.sentinel_forwarder.aws_lambda_function.sentinel_forwarder` |
| recreate | `aws_secretsmanager_secret_version.eks_karpenter_ami_id`           |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
12:34:26.668 STDOUT terraform:   ~ update in-place
12:34:26.668 STDOUT terraform: -/+ destroy and then create replacement
12:34:26.668 STDOUT terraform: Terraform will perform the following actions:
12:34:26.668 STDOUT terraform:   # aws_eks_node_group.notification-canada-ca-eks-node-group-k8s will be updated in-place
12:34:26.668 STDOUT terraform:   ~ resource "aws_eks_node_group" "notification-canada-ca-eks-node-group-k8s" {
12:34:26.668 STDOUT terraform:         id                     = "notification-canada-ca-staging-eks-cluster:notification-canada-ca-staging-eks-primary-node-group-k8s"
12:34:26.669 STDOUT terraform:       ~ release_version        = "1.33.4-20250915" -> "1.33.5-20250920"
12:34:26.669 STDOUT terraform:         tags                   = {
12:34:26.669 STDOUT terraform:             "CostCenter"             = "notification-canada-ca-staging"
12:34:26.669 STDOUT terraform:             "Name"                   = "notification-canada-ca"
12:34:26.669 STDOUT terraform:             "karpenter.sh/discovery" = "notification-canada-ca-staging-eks-cluster"
12:34:26.669 STDOUT terraform:         }
12:34:26.669 STDOUT terraform:         # (17 unchanged attributes hidden)
12:34:26.669 STDOUT terraform:         # (3 unchanged blocks hidden)
12:34:26.669 STDOUT terraform:     }
12:34:26.669 STDOUT terraform:   # aws_secretsmanager_secret_version.eks_karpenter_ami_id must be replaced
12:34:26.669 STDOUT terraform: -/+ resource "aws_secretsmanager_secret_version" "eks_karpenter_ami_id" {
12:34:26.669 STDOUT terraform:       ~ arn                  = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:EKS_KARPENTER_AMI_ID-RMKHzX" -> (known after apply)
12:34:26.669 STDOUT terraform:       + has_secret_string_wo = (known after apply)
12:34:26.669 STDOUT terraform:       ~ id                   = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:EKS_KARPENTER_AMI_ID-RMKHzX|terraform-20250922143323120700000002" -> (known after apply)
12:34:26.670 STDOUT terraform:       ~ secret_string        = (sensitive value) # forces replacement
12:34:26.670 STDOUT terraform:       ~ version_id           = "terraform-20250922143323120700000002" -> (known after apply)
12:34:26.670 STDOUT terraform:       ~ version_stages       = [
12:34:26.670 STDOUT terraform:           - "AWSCURRENT",
12:34:26.670 STDOUT terraform:         ] -> (known after apply)
12:34:26.670 STDOUT terraform:         # (4 unchanged attributes hidden)
12:34:26.670 STDOUT terraform:     }
12:34:26.670 STDOUT terraform:   # module.sentinel_forwarder.aws_lambda_function.sentinel_forwarder will be updated in-place
12:34:26.670 STDOUT terraform:   ~ resource "aws_lambda_function" "sentinel_forwarder" {
12:34:26.670 STDOUT terraform:         id                             = "sentinel-cloud-watch-forwarder"
12:34:26.670 STDOUT terraform:       ~ layers                         = [
12:34:26.670 STDOUT terraform:           ~ (sensitive value),
12:34:26.670 STDOUT terraform:         ]
12:34:26.670 STDOUT terraform:         tags                           = {
12:34:26.670 STDOUT terraform:             "CostCentre" = "notification-canada-ca-staging"
12:34:26.670 STDOUT terraform:         }
12:34:26.670 STDOUT terraform:         # (30 unchanged attributes hidden)
12:34:26.670 STDOUT terraform:         # (4 unchanged blocks hidden)
12:34:26.670 STDOUT terraform:     }
12:34:26.670 STDOUT terraform: Plan: 1 to add, 2 to change, 1 to destroy.
12:34:26.670 STDOUT terraform: Warning: Deprecated attribute
12:34:26.670 STDOUT terraform:   on .terraform/modules/sentinel_forwarder/sentinel_forwarder/main.tf line 85, in resource "aws_lambda_permission" "sentinel_forwarder_cloudwatch_log_subscription":
12:34:26.671 STDOUT terraform:   85:   principal     = "logs.${data.aws_region.current.name}.amazonaws.com"
12:34:26.671 STDOUT terraform: The attribute "name" is deprecated. Refer to the provider documentation for
12:34:26.671 STDOUT terraform: details.
12:34:26.671 STDOUT terraform: (and 3 more similar warnings elsewhere)
12:34:26.671 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
12:34:26.671 STDOUT terraform: Saved the plan to: plan.tfplan
12:34:26.671 STDOUT terraform: To perform exactly these actions, run the following command to apply:
12:34:26.671 STDOUT terraform:     terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.celery-error[0]"]
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.oom-errors[0]"]
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.scanfiles-timeout[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.client_vpn"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca-alt[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.internal_alb_tls"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.internal_nginx_http"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-admin"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-documentation"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.blazer[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-application-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-cluster-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-host-logs[0]"]
WARN - plan.json - main - Missing Common...
```

</details>
